docs/perf/2026-02-11/20260211-104354/20260211-104354/step-ramp-2.out

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: /k6/k6/submit-step-ramp.js
        output: -

     scenarios: (100.00%) 1 scenario, 800 max VUs, 4m0s max duration (incl. graceful stop):
              * step_ramp: Up to 200.00 iterations/s for 3m30s over 11 stages (maxVUs: 100-800, gracefulStop: 30s)


running (0m00.9s), 000/100 VUs, 0 complete and 0 interrupted iterations
step_ramp   [   0% ] 000/100 VUs  0m00.9s/3m30s  000.71 iters/s

running (0m01.9s), 000/100 VUs, 1 complete and 0 interrupted iterations
step_ramp   [   1% ] 000/100 VUs  0m01.9s/3m30s  001.71 iters/s

running (0m02.9s), 000/100 VUs, 4 complete and 0 interrupted iterations
step_ramp   [   1% ] 000/100 VUs  0m02.9s/3m30s  003.00 iters/s

running (0m03.9s), 000/100 VUs, 7 complete and 0 interrupted iterations
step_ramp   [   2% ] 000/100 VUs  0m03.9s/3m30s  003.87 iters/s

running (0m04.9s), 000/100 VUs, 12 complete and 0 interrupted iterations
step_ramp   [   2% ] 000/100 VUs  0m04.9s/3m30s  005.00 iters/s

running (0m05.9s), 000/100 VUs, 17 complete and 0 interrupted iterations
step_ramp   [   3% ] 000/100 VUs  0m05.9s/3m30s  005.92 iters/s

running (0m06.9s), 000/100 VUs, 23 complete and 0 interrupted iterations
step_ramp   [   3% ] 000/100 VUs  0m06.9s/3m30s  006.86 iters/s

running (0m07.9s), 000/100 VUs, 31 complete and 0 interrupted iterations
step_ramp   [   4% ] 000/100 VUs  0m07.9s/3m30s  007.94 iters/s

running (0m08.9s), 000/100 VUs, 39 complete and 0 interrupted iterations
step_ramp   [   4% ] 000/100 VUs  0m08.9s/3m30s  008.89 iters/s

running (0m09.9s), 001/100 VUs, 48 complete and 0 interrupted iterations
step_ramp   [   5% ] 001/100 VUs  0m09.9s/3m30s  009.95 iters/s

running (0m10.9s), 000/100 VUs, 59 complete and 0 interrupted iterations
step_ramp   [   5% ] 000/100 VUs  0m10.9s/3m30s  010.91 iters/s

running (0m11.9s), 001/100 VUs, 70 complete and 0 interrupted iterations
step_ramp   [   6% ] 001/100 VUs  0m11.9s/3m30s  011.96 iters/s

running (0m12.9s), 000/100 VUs, 83 complete and 0 interrupted iterations
step_ramp   [   6% ] 000/100 VUs  0m12.9s/3m30s  012.92 iters/s

running (0m13.9s), 000/100 VUs, 96 complete and 0 interrupted iterations
step_ramp   [   7% ] 000/100 VUs  0m13.9s/3m30s  013.89 iters/s

running (0m14.9s), 000/100 VUs, 111 complete and 0 interrupted iterations
step_ramp   [   7% ] 000/100 VUs  0m14.9s/3m30s  014.93 iters/s

running (0m15.9s), 000/100 VUs, 126 complete and 0 interrupted iterations
step_ramp   [   8% ] 000/100 VUs  0m15.9s/3m30s  015.91 iters/s

running (0m16.9s), 001/100 VUs, 142 complete and 0 interrupted iterations
step_ramp   [   8% ] 001/100 VUs  0m16.9s/3m30s  016.94 iters/s

running (0m17.9s), 000/100 VUs, 160 complete and 0 interrupted iterations
step_ramp   [   9% ] 000/100 VUs  0m17.9s/3m30s  017.92 iters/s

running (0m18.9s), 001/100 VUs, 178 complete and 0 interrupted iterations
step_ramp   [   9% ] 001/100 VUs  0m18.9s/3m30s  018.95 iters/s

running (0m19.9s), 000/100 VUs, 198 complete and 0 interrupted iterations
step_ramp   [   9% ] 000/100 VUs  0m19.9s/3m30s  019.92 iters/s

running (0m20.9s), 000/100 VUs, 218 complete and 0 interrupted iterations
step_ramp   [  10% ] 000/100 VUs  0m20.9s/3m30s  020.90 iters/s

running (0m21.9s), 001/100 VUs, 239 complete and 0 interrupted iterations
step_ramp   [  10% ] 001/100 VUs  0m21.9s/3m30s  021.93 iters/s

running (0m22.9s), 001/100 VUs, 261 complete and 0 interrupted iterations
step_ramp   [  11% ] 001/100 VUs  0m22.9s/3m30s  022.91 iters/s

running (0m23.9s), 001/100 VUs, 285 complete and 0 interrupted iterations
step_ramp   [  11% ] 001/100 VUs  0m23.9s/3m30s  023.94 iters/s

running (0m24.9s), 000/100 VUs, 310 complete and 0 interrupted iterations
step_ramp   [  12% ] 000/100 VUs  0m24.9s/3m30s  024.92 iters/s

running (0m25.9s), 001/100 VUs, 335 complete and 0 interrupted iterations
step_ramp   [  12% ] 001/100 VUs  0m25.9s/3m30s  025.94 iters/s

running (0m26.9s), 000/100 VUs, 362 complete and 0 interrupted iterations
step_ramp   [  13% ] 000/100 VUs  0m26.9s/3m30s  026.93 iters/s

running (0m27.9s), 000/100 VUs, 389 complete and 0 interrupted iterations
step_ramp   [  13% ] 000/100 VUs  0m27.9s/3m30s  027.91 iters/s

running (0m28.9s), 001/100 VUs, 417 complete and 0 interrupted iterations
step_ramp   [  14% ] 001/100 VUs  0m28.9s/3m30s  028.93 iters/s

running (0m29.9s), 000/100 VUs, 447 complete and 0 interrupted iterations
step_ramp   [  14% ] 000/100 VUs  0m29.9s/3m30s  029.92 iters/s

running (0m30.9s), 001/100 VUs, 477 complete and 0 interrupted iterations
step_ramp   [  15% ] 001/100 VUs  0m30.9s/3m30s  030.94 iters/s

running (0m31.9s), 000/100 VUs, 509 complete and 0 interrupted iterations
step_ramp   [  15% ] 000/100 VUs  0m31.9s/3m30s  031.92 iters/s

running (0m32.9s), 001/100 VUs, 541 complete and 0 interrupted iterations
step_ramp   [  16% ] 001/100 VUs  0m32.9s/3m30s  032.94 iters/s

running (0m33.9s), 001/100 VUs, 574 complete and 0 interrupted iterations
step_ramp   [  16% ] 001/100 VUs  0m33.9s/3m30s  033.93 iters/s

running (0m34.9s), 000/100 VUs, 609 complete and 0 interrupted iterations
step_ramp   [  17% ] 000/100 VUs  0m34.9s/3m30s  034.91 iters/s

running (0m35.9s), 001/100 VUs, 644 complete and 0 interrupted iterations
step_ramp   [  17% ] 001/100 VUs  0m35.9s/3m30s  035.93 iters/s

running (0m36.9s), 000/100 VUs, 681 complete and 0 interrupted iterations
step_ramp   [  18% ] 000/100 VUs  0m36.9s/3m30s  036.92 iters/s

running (0m37.9s), 001/100 VUs, 718 complete and 0 interrupted iterations
step_ramp   [  18% ] 001/100 VUs  0m37.9s/3m30s  037.93 iters/s

running (0m38.9s), 001/100 VUs, 756 complete and 0 interrupted iterations
step_ramp   [  19% ] 001/100 VUs  0m38.9s/3m30s  038.92 iters/s

running (0m39.9s), 000/100 VUs, 796 complete and 0 interrupted iterations
step_ramp   [  19% ] 000/100 VUs  0m39.9s/3m30s  039.91 iters/s

running (0m40.9s), 001/100 VUs, 836 complete and 0 interrupted iterations
step_ramp   [  19% ] 001/100 VUs  0m40.9s/3m30s  040.93 iters/s

running (0m41.9s), 001/100 VUs, 877 complete and 0 interrupted iterations
step_ramp   [  20% ] 001/100 VUs  0m41.9s/3m30s  041.92 iters/s

running (0m42.9s), 001/100 VUs, 920 complete and 0 interrupted iterations
step_ramp   [  20% ] 001/100 VUs  0m42.9s/3m30s  042.93 iters/s

running (0m43.9s), 000/100 VUs, 964 complete and 0 interrupted iterations
step_ramp   [  21% ] 000/100 VUs  0m43.9s/3m30s  043.92 iters/s

running (0m44.9s), 001/100 VUs, 1008 complete and 0 interrupted iterations
step_ramp   [  21% ] 001/100 VUs  0m44.9s/3m30s  044.93 iters/s

running (0m45.9s), 001/100 VUs, 1053 complete and 0 interrupted iterations
step_ramp   [  22% ] 001/100 VUs  0m45.9s/3m30s  045.92 iters/s

running (0m46.9s), 000/100 VUs, 1100 complete and 0 interrupted iterations
step_ramp   [  22% ] 000/100 VUs  0m46.9s/3m30s  046.91 iters/s

running (0m47.9s), 002/100 VUs, 1146 complete and 0 interrupted iterations
step_ramp   [  23% ] 002/100 VUs  0m47.9s/3m30s  047.93 iters/s

running (0m48.9s), 004/100 VUs, 1192 complete and 0 interrupted iterations
step_ramp   [  23% ] 004/100 VUs  0m48.9s/3m30s  048.92 iters/s

running (0m49.9s), 001/100 VUs, 1245 complete and 0 interrupted iterations
step_ramp   [  24% ] 001/100 VUs  0m49.9s/3m30s  049.93 iters/s

running (0m50.9s), 001/100 VUs, 1295 complete and 0 interrupted iterations
step_ramp   [  24% ] 001/100 VUs  0m50.9s/3m30s  050.92 iters/s

running (0m51.9s), 000/100 VUs, 1347 complete and 0 interrupted iterations
step_ramp   [  25% ] 000/100 VUs  0m51.9s/3m30s  051.93 iters/s

running (0m52.9s), 001/100 VUs, 1399 complete and 0 interrupted iterations
step_ramp   [  25% ] 001/100 VUs  0m52.9s/3m30s  052.92 iters/s

running (0m53.9s), 000/100 VUs, 1453 complete and 0 interrupted iterations
step_ramp   [  26% ] 000/100 VUs  0m53.9s/3m30s  053.92 iters/s

running (0m54.9s), 002/100 VUs, 1506 complete and 0 interrupted iterations
step_ramp   [  26% ] 002/100 VUs  0m54.9s/3m30s  054.93 iters/s

running (0m55.9s), 002/100 VUs, 1561 complete and 0 interrupted iterations
step_ramp   [  27% ] 002/100 VUs  0m55.9s/3m30s  055.92 iters/s

running (0m56.9s), 003/100 VUs, 1617 complete and 0 interrupted iterations
step_ramp   [  27% ] 003/100 VUs  0m56.9s/3m30s  056.93 iters/s

running (0m57.9s), 001/100 VUs, 1676 complete and 0 interrupted iterations
step_ramp   [  28% ] 001/100 VUs  0m57.9s/3m30s  057.92 iters/s

running (0m58.9s), 001/100 VUs, 1735 complete and 0 interrupted iterations
step_ramp   [  28% ] 001/100 VUs  0m58.9s/3m30s  058.93 iters/s

running (0m59.9s), 001/100 VUs, 1794 complete and 0 interrupted iterations
step_ramp   [  29% ] 001/100 VUs  0m59.9s/3m30s  059.92 iters/s

running (1m00.9s), 000/100 VUs, 1855 complete and 0 interrupted iterations
step_ramp   [  29% ] 000/100 VUs  1m00.9s/3m30s  060.92 iters/s

running (1m01.9s), 001/100 VUs, 1916 complete and 0 interrupted iterations
step_ramp   [  29% ] 001/100 VUs  1m01.9s/3m30s  061.93 iters/s

running (1m02.9s), 005/100 VUs, 1974 complete and 0 interrupted iterations
step_ramp   [  30% ] 005/100 VUs  1m02.9s/3m30s  062.92 iters/s

running (1m03.9s), 004/100 VUs, 2039 complete and 0 interrupted iterations
step_ramp   [  30% ] 004/100 VUs  1m03.9s/3m30s  063.93 iters/s

running (1m04.9s), 001/100 VUs, 2106 complete and 0 interrupted iterations
step_ramp   [  31% ] 001/100 VUs  1m04.9s/3m30s  064.92 iters/s

running (1m05.9s), 001/100 VUs, 2172 complete and 0 interrupted iterations
step_ramp   [  31% ] 001/100 VUs  1m05.9s/3m30s  065.93 iters/s

running (1m06.9s), 003/100 VUs, 2236 complete and 0 interrupted iterations
step_ramp   [  32% ] 003/100 VUs  1m06.9s/3m30s  066.93 iters/s

running (1m07.9s), 001/100 VUs, 2305 complete and 0 interrupted iterations
step_ramp   [  32% ] 001/100 VUs  1m07.9s/3m30s  067.92 iters/s

running (1m08.9s), 001/100 VUs, 2374 complete and 0 interrupted iterations
step_ramp   [  33% ] 001/100 VUs  1m08.9s/3m30s  068.93 iters/s

running (1m09.9s), 003/100 VUs, 2441 complete and 0 interrupted iterations
step_ramp   [  33% ] 003/100 VUs  1m09.9s/3m30s  069.92 iters/s

running (1m10.9s), 010/100 VUs, 2505 complete and 0 interrupted iterations
step_ramp   [  34% ] 010/100 VUs  1m10.9s/3m30s  070.93 iters/s

running (1m11.9s), 004/100 VUs, 2582 complete and 0 interrupted iterations
step_ramp   [  34% ] 004/100 VUs  1m11.9s/3m30s  071.92 iters/s

running (1m12.9s), 001/100 VUs, 2657 complete and 0 interrupted iterations
step_ramp   [  35% ] 001/100 VUs  1m12.9s/3m30s  072.92 iters/s

running (1m13.9s), 001/100 VUs, 2731 complete and 0 interrupted iterations
step_ramp   [  35% ] 001/100 VUs  1m13.9s/3m30s  073.93 iters/s

running (1m14.9s), 001/100 VUs, 2805 complete and 0 interrupted iterations
step_ramp   [  36% ] 001/100 VUs  1m14.9s/3m30s  074.92 iters/s

running (1m15.9s), 001/100 VUs, 2881 complete and 0 interrupted iterations
step_ramp   [  36% ] 001/100 VUs  1m15.9s/3m30s  075.93 iters/s

running (1m16.9s), 001/100 VUs, 2957 complete and 0 interrupted iterations
step_ramp   [  37% ] 001/100 VUs  1m16.9s/3m30s  076.92 iters/s

running (1m17.9s), 010/100 VUs, 3026 complete and 0 interrupted iterations
step_ramp   [  37% ] 010/100 VUs  1m17.9s/3m30s  077.93 iters/s

running (1m18.9s), 016/100 VUs, 3098 complete and 0 interrupted iterations
step_ramp   [  38% ] 016/100 VUs  1m18.9s/3m30s  078.92 iters/s

running (1m19.9s), 010/100 VUs, 3183 complete and 0 interrupted iterations
step_ramp   [  38% ] 010/100 VUs  1m19.9s/3m30s  079.92 iters/s

running (1m20.9s), 001/100 VUs, 3273 complete and 0 interrupted iterations
step_ramp   [  39% ] 001/100 VUs  1m20.9s/3m30s  080.93 iters/s

running (1m21.9s), 001/100 VUs, 3354 complete and 0 interrupted iterations
step_ramp   [  39% ] 001/100 VUs  1m21.9s/3m30s  081.92 iters/s

running (1m22.9s), 001/100 VUs, 3437 complete and 0 interrupted iterations
step_ramp   [  39% ] 001/100 VUs  1m22.9s/3m30s  082.93 iters/s

running (1m23.9s), 003/100 VUs, 3518 complete and 0 interrupted iterations
step_ramp   [  40% ] 003/100 VUs  1m23.9s/3m30s  083.92 iters/s

running (1m24.9s), 001/100 VUs, 3604 complete and 0 interrupted iterations
step_ramp   [  40% ] 001/100 VUs  1m24.9s/3m30s  084.93 iters/s

running (1m25.9s), 020/100 VUs, 3671 complete and 0 interrupted iterations
step_ramp   [  41% ] 020/100 VUs  1m25.9s/3m30s  085.92 iters/s

running (1m26.9s), 027/100 VUs, 3750 complete and 0 interrupted iterations
step_ramp   [  41% ] 027/100 VUs  1m26.9s/3m30s  086.92 iters/s

running (1m27.9s), 026/100 VUs, 3839 complete and 0 interrupted iterations
step_ramp   [  42% ] 026/100 VUs  1m27.9s/3m30s  087.93 iters/s

running (1m28.9s), 007/100 VUs, 3946 complete and 0 interrupted iterations
step_ramp   [  42% ] 007/100 VUs  1m28.9s/3m30s  088.92 iters/s

running (1m29.9s), 002/100 VUs, 4041 complete and 0 interrupted iterations
step_ramp   [  43% ] 002/100 VUs  1m29.9s/3m30s  089.93 iters/s

running (1m30.9s), 001/100 VUs, 4132 complete and 0 interrupted iterations
step_ramp   [  43% ] 001/100 VUs  1m30.9s/3m30s  090.92 iters/s

running (1m31.9s), 002/100 VUs, 4223 complete and 0 interrupted iterations
step_ramp   [  44% ] 002/100 VUs  1m31.9s/3m30s  091.93 iters/s

running (1m32.9s), 001/100 VUs, 4316 complete and 0 interrupted iterations
step_ramp   [  44% ] 001/100 VUs  1m32.9s/3m30s  092.92 iters/s

running (1m33.9s), 014/100 VUs, 4396 complete and 0 interrupted iterations
step_ramp   [  45% ] 014/100 VUs  1m33.9s/3m30s  093.92 iters/s

running (1m34.9s), 045/100 VUs, 4460 complete and 0 interrupted iterations
step_ramp   [  45% ] 045/100 VUs  1m34.9s/3m30s  094.93 iters/s

running (1m35.9s), 044/100 VUs, 4556 complete and 0 interrupted iterations
step_ramp   [  46% ] 044/100 VUs  1m35.9s/3m30s  095.92 iters/s

running (1m36.9s), 031/100 VUs, 4666 complete and 0 interrupted iterations
step_ramp   [  46% ] 031/100 VUs  1m36.9s/3m30s  096.93 iters/s

running (1m37.9s), 010/100 VUs, 4784 complete and 0 interrupted iterations
step_ramp   [  47% ] 010/100 VUs  1m37.9s/3m30s  097.92 iters/s

running (1m38.9s), 012/100 VUs, 4880 complete and 0 interrupted iterations
step_ramp   [  47% ] 012/100 VUs  1m38.9s/3m30s  098.92 iters/s

running (1m39.9s), 012/100 VUs, 4980 complete and 0 interrupted iterations
step_ramp   [  48% ] 012/100 VUs  1m39.9s/3m30s  099.92 iters/s

running (1m40.9s), 011/100 VUs, 5081 complete and 0 interrupted iterations
step_ramp   [  48% ] 011/100 VUs  1m40.9s/3m30s  100.92 iters/s

running (1m41.9s), 008/100 VUs, 5186 complete and 0 interrupted iterations
step_ramp   [  49% ] 008/100 VUs  1m41.9s/3m30s  101.93 iters/s

running (1m42.9s), 041/100 VUs, 5255 complete and 0 interrupted iterations
step_ramp   [  49% ] 041/100 VUs  1m42.9s/3m30s  102.92 iters/s

running (1m43.9s), 048/100 VUs, 5352 complete and 0 interrupted iterations
step_ramp   [  49% ] 048/100 VUs  1m43.9s/3m30s  103.93 iters/s

running (1m44.9s), 071/100 VUs, 5433 complete and 0 interrupted iterations
step_ramp   [  50% ] 071/100 VUs  1m44.9s/3m30s  104.92 iters/s

running (1m45.9s), 038/100 VUs, 5571 complete and 0 interrupted iterations
step_ramp   [  50% ] 038/100 VUs  1m45.9s/3m30s  105.92 iters/s

running (1m46.9s), 010/100 VUs, 5706 complete and 0 interrupted iterations
step_ramp   [  51% ] 010/100 VUs  1m46.9s/3m30s  106.93 iters/s

running (1m47.9s), 006/100 VUs, 5817 complete and 0 interrupted iterations
step_ramp   [  51% ] 006/100 VUs  1m47.9s/3m30s  107.93 iters/s

running (1m48.9s), 005/100 VUs, 5927 complete and 0 interrupted iterations
step_ramp   [  52% ] 005/100 VUs  1m48.9s/3m30s  108.93 iters/s

running (1m49.9s), 019/100 VUs, 6022 complete and 0 interrupted iterations
step_ramp   [  52% ] 019/100 VUs  1m49.9s/3m30s  109.92 iters/s

running (1m50.9s), 026/100 VUs, 6126 complete and 0 interrupted iterations
step_ramp   [  53% ] 026/100 VUs  1m50.9s/3m30s  110.93 iters/s

running (1m51.9s), 099/101 VUs, 6163 complete and 0 interrupted iterations
step_ramp   [  53% ] 099/101 VUs  1m51.9s/3m30s  111.92 iters/s

running (1m52.9s), 103/111 VUs, 6260 complete and 0 interrupted iterations
step_ramp   [  54% ] 103/111 VUs  1m52.9s/3m30s  112.94 iters/s

running (1m53.9s), 078/112 VUs, 6397 complete and 0 interrupted iterations
step_ramp   [  54% ] 078/112 VUs  1m53.9s/3m30s  113.93 iters/s

running (1m54.9s), 063/112 VUs, 6526 complete and 0 interrupted iterations
step_ramp   [  55% ] 063/112 VUs  1m54.9s/3m30s  114.92 iters/s

running (1m55.9s), 047/112 VUs, 6658 complete and 0 interrupted iterations
step_ramp   [  55% ] 047/112 VUs  1m55.9s/3m30s  115.93 iters/s

running (1m56.9s), 021/112 VUs, 6800 complete and 0 interrupted iterations
step_ramp   [  56% ] 021/112 VUs  1m56.9s/3m30s  116.92 iters/s

running (1m58.0s), 011/112 VUs, 6930 complete and 0 interrupted iterations
step_ramp   [  56% ] 011/112 VUs  1m58.0s/3m30s  117.96 iters/s

running (1m58.9s), 011/112 VUs, 7046 complete and 0 interrupted iterations
step_ramp   [  57% ] 011/112 VUs  1m58.9s/3m30s  118.92 iters/s

running (1m59.9s), 011/112 VUs, 7165 complete and 0 interrupted iterations
step_ramp   [  57% ] 011/112 VUs  1m59.9s/3m30s  119.92 iters/s

running (2m00.9s), 077/112 VUs, 7220 complete and 0 interrupted iterations
step_ramp   [  58% ] 077/112 VUs  2m00.9s/3m30s  120.93 iters/s

running (2m01.9s), 111/116 VUs, 7303 complete and 0 interrupted iterations
step_ramp   [  58% ] 111/116 VUs  2m01.9s/3m30s  121.92 iters/s

running (2m02.9s), 114/126 VUs, 7408 complete and 0 interrupted iterations
step_ramp   [  59% ] 114/126 VUs  2m02.9s/3m30s  122.93 iters/s

running (2m03.9s), 097/139 VUs, 7531 complete and 0 interrupted iterations
step_ramp   [  59% ] 097/139 VUs  2m03.9s/3m30s  123.92 iters/s

running (2m04.9s), 086/139 VUs, 7666 complete and 0 interrupted iterations
step_ramp   [  59% ] 086/139 VUs  2m04.9s/3m30s  124.93 iters/s

running (2m05.9s), 090/139 VUs, 7788 complete and 0 interrupted iterations
step_ramp   [  60% ] 090/139 VUs  2m05.9s/3m30s  125.92 iters/s

running (2m06.9s), 067/139 VUs, 7937 complete and 0 interrupted iterations
step_ramp   [  60% ] 067/139 VUs  2m06.9s/3m30s  126.92 iters/s

running (2m07.9s), 053/139 VUs, 8079 complete and 0 interrupted iterations
step_ramp   [  61% ] 053/139 VUs  2m07.9s/3m30s  127.93 iters/s

running (2m08.9s), 049/139 VUs, 8211 complete and 0 interrupted iterations
step_ramp   [  61% ] 049/139 VUs  2m08.9s/3m30s  128.92 iters/s

running (2m09.9s), 044/139 VUs, 8346 complete and 0 interrupted iterations
step_ramp   [  62% ] 044/139 VUs  2m09.9s/3m30s  129.93 iters/s

running (2m10.9s), 086/139 VUs, 8433 complete and 0 interrupted iterations
step_ramp   [  62% ] 086/139 VUs  2m10.9s/3m30s  130.93 iters/s

running (2m11.9s), 148/155 VUs, 8487 complete and 0 interrupted iterations
step_ramp   [  63% ] 148/155 VUs  2m11.9s/3m30s  131.92 iters/s

running (2m12.9s), 172/172 VUs, 8575 complete and 0 interrupted iterations
step_ramp   [  63% ] 172/172 VUs  2m12.9s/3m30s  132.92 iters/s

running (2m13.9s), 142/181 VUs, 8727 complete and 0 interrupted iterations
step_ramp   [  64% ] 142/181 VUs  2m13.9s/3m30s  133.93 iters/s

running (2m14.9s), 122/181 VUs, 8881 complete and 0 interrupted iterations
step_ramp   [  64% ] 122/181 VUs  2m14.9s/3m30s  134.93 iters/s

running (2m15.9s), 117/181 VUs, 9021 complete and 0 interrupted iterations
step_ramp   [  65% ] 117/181 VUs  2m15.9s/3m30s  135.92 iters/s

running (2m16.9s), 097/181 VUs, 9177 complete and 0 interrupted iterations
step_ramp   [  65% ] 097/181 VUs  2m16.9s/3m30s  136.92 iters/s

running (2m17.9s), 088/181 VUs, 9324 complete and 0 interrupted iterations
step_ramp   [  66% ] 088/181 VUs  2m17.9s/3m30s  137.92 iters/s

running (2m18.9s), 071/181 VUs, 9479 complete and 0 interrupted iterations
step_ramp   [  66% ] 071/181 VUs  2m18.9s/3m30s  138.92 iters/s

running (2m19.9s), 076/181 VUs, 9614 complete and 0 interrupted iterations
step_ramp   [  67% ] 076/181 VUs  2m19.9s/3m30s  139.92 iters/s

running (2m20.9s), 127/181 VUs, 9703 complete and 0 interrupted iterations
step_ramp   [  67% ] 127/181 VUs  2m20.9s/3m30s  140.92 iters/s

running (2m21.9s), 181/188 VUs, 9784 complete and 0 interrupted iterations
step_ramp   [  68% ] 181/188 VUs  2m21.9s/3m30s  141.93 iters/s

running (2m22.9s), 187/201 VUs, 9897 complete and 0 interrupted iterations
step_ramp   [  68% ] 187/201 VUs  2m22.9s/3m30s  142.92 iters/s

running (2m23.9s), 211/212 VUs, 10003 complete and 0 interrupted iterations
step_ramp   [  69% ] 211/212 VUs  2m23.9s/3m30s  143.93 iters/s

running (2m24.9s), 187/213 VUs, 10170 complete and 0 interrupted iterations
step_ramp   [  69% ] 187/213 VUs  2m24.9s/3m30s  144.92 iters/s

running (2m25.9s), 161/213 VUs, 10341 complete and 0 interrupted iterations
step_ramp   [  69% ] 161/213 VUs  2m25.9s/3m30s  145.93 iters/s

running (2m26.9s), 158/213 VUs, 10491 complete and 0 interrupted iterations
step_ramp   [  70% ] 158/213 VUs  2m26.9s/3m30s  146.93 iters/s

running (2m27.9s), 146/213 VUs, 10650 complete and 0 interrupted iterations
step_ramp   [  70% ] 146/213 VUs  2m27.9s/3m30s  147.92 iters/s

running (2m28.9s), 119/213 VUs, 10826 complete and 0 interrupted iterations
step_ramp   [  71% ] 119/213 VUs  2m28.9s/3m30s  148.93 iters/s

running (2m29.9s), 123/213 VUs, 10971 complete and 0 interrupted iterations
step_ramp   [  71% ] 123/213 VUs  2m29.9s/3m30s  149.92 iters/s

running (2m30.9s), 109/213 VUs, 11135 complete and 0 interrupted iterations
step_ramp   [  72% ] 109/213 VUs  2m30.9s/3m30s  150.93 iters/s

running (2m31.9s), 174/213 VUs, 11222 complete and 0 interrupted iterations
step_ramp   [  72% ] 174/213 VUs  2m31.9s/3m30s  151.92 iters/s

running (2m32.9s), 218/223 VUs, 11312 complete and 0 interrupted iterations
step_ramp   [  73% ] 218/223 VUs  2m32.9s/3m30s  152.92 iters/s

running (2m33.9s), 217/233 VUs, 11454 complete and 0 interrupted iterations
step_ramp   [  73% ] 217/233 VUs  2m33.9s/3m30s  153.93 iters/s

running (2m34.9s), 240/240 VUs, 11569 complete and 0 interrupted iterations
step_ramp   [  74% ] 240/240 VUs  2m34.9s/3m30s  154.93 iters/s

running (2m35.9s), 204/242 VUs, 11757 complete and 0 interrupted iterations
step_ramp   [  74% ] 204/242 VUs  2m35.9s/3m30s  155.93 iters/s

running (2m36.9s), 191/242 VUs, 11926 complete and 0 interrupted iterations
step_ramp   [  75% ] 191/242 VUs  2m36.9s/3m30s  156.92 iters/s

running (2m37.9s), 192/242 VUs, 12057 complete and 0 interrupted iterations
step_ramp   [  75% ] 192/242 VUs  2m37.9s/3m30s  157.88 iters/s

running (2m38.9s), 200/242 VUs, 12232 complete and 0 interrupted iterations
step_ramp   [  76% ] 200/242 VUs  2m38.9s/3m30s  158.92 iters/s

running (2m39.9s), 191/242 VUs, 12401 complete and 0 interrupted iterations
step_ramp   [  76% ] 191/242 VUs  2m39.9s/3m30s  159.92 iters/s

running (2m40.9s), 182/242 VUs, 12571 complete and 0 interrupted iterations
step_ramp   [  77% ] 182/242 VUs  2m40.9s/3m30s  160.93 iters/s

running (2m41.9s), 195/242 VUs, 12719 complete and 0 interrupted iterations
step_ramp   [  77% ] 195/242 VUs  2m41.9s/3m30s  161.92 iters/s

running (2m42.9s), 241/242 VUs, 12835 complete and 0 interrupted iterations
step_ramp   [  78% ] 241/242 VUs  2m42.9s/3m30s  162.92 iters/s

running (2m43.9s), 257/271 VUs, 12941 complete and 0 interrupted iterations
step_ramp   [  78% ] 257/271 VUs  2m43.9s/3m30s  163.92 iters/s

running (2m44.9s), 235/276 VUs, 13065 complete and 0 interrupted iterations
step_ramp   [  79% ] 235/276 VUs  2m44.9s/3m30s  164.76 iters/s

running (2m45.9s), 249/277 VUs, 13253 complete and 0 interrupted iterations
step_ramp   [  79% ] 249/277 VUs  2m45.9s/3m30s  165.92 iters/s

running (2m46.9s), 263/289 VUs, 13380 complete and 0 interrupted iterations
step_ramp   [  79% ] 263/289 VUs  2m46.9s/3m30s  166.92 iters/s

running (2m47.9s), 220/289 VUs, 13591 complete and 0 interrupted iterations
step_ramp   [  80% ] 220/289 VUs  2m47.9s/3m30s  167.93 iters/s

running (2m48.9s), 170/289 VUs, 13810 complete and 0 interrupted iterations
step_ramp   [  80% ] 170/289 VUs  2m48.9s/3m30s  168.92 iters/s

running (2m49.9s), 172/289 VUs, 13977 complete and 0 interrupted iterations
step_ramp   [  81% ] 172/289 VUs  2m49.9s/3m30s  169.92 iters/s

running (2m50.9s), 162/289 VUs, 14158 complete and 0 interrupted iterations
step_ramp   [  81% ] 162/289 VUs  2m50.9s/3m30s  170.92 iters/s

running (2m51.9s), 163/289 VUs, 14328 complete and 0 interrupted iterations
step_ramp   [  82% ] 163/289 VUs  2m51.9s/3m30s  171.92 iters/s

running (2m52.9s), 179/289 VUs, 14485 complete and 0 interrupted iterations
step_ramp   [  82% ] 179/289 VUs  2m52.9s/3m30s  172.92 iters/s

running (2m53.9s), 171/289 VUs, 14666 complete and 0 interrupted iterations
step_ramp   [  83% ] 171/289 VUs  2m53.9s/3m30s  173.92 iters/s

running (2m54.9s), 206/289 VUs, 14805 complete and 0 interrupted iterations
step_ramp   [  83% ] 206/289 VUs  2m54.9s/3m30s  174.92 iters/s

running (2m55.9s), 261/289 VUs, 14926 complete and 0 interrupted iterations
step_ramp   [  84% ] 261/289 VUs  2m55.9s/3m30s  175.92 iters/s

running (2m56.9s), 288/290 VUs, 15071 complete and 0 interrupted iterations
step_ramp   [  84% ] 288/290 VUs  2m56.9s/3m30s  176.92 iters/s

running (2m57.9s), 268/290 VUs, 15270 complete and 0 interrupted iterations
step_ramp   [  85% ] 268/290 VUs  2m57.9s/3m30s  177.92 iters/s

running (2m58.9s), 242/290 VUs, 15475 complete and 0 interrupted iterations
step_ramp   [  85% ] 242/290 VUs  2m58.9s/3m30s  178.92 iters/s

running (2m59.9s), 218/290 VUs, 15679 complete and 0 interrupted iterations
step_ramp   [  86% ] 218/290 VUs  2m59.9s/3m30s  179.93 iters/s

running (3m00.9s), 191/290 VUs, 15886 complete and 0 interrupted iterations
step_ramp   [  86% ] 191/290 VUs  3m00.9s/3m30s  180.92 iters/s

running (3m01.9s), 188/290 VUs, 16064 complete and 0 interrupted iterations
step_ramp   [  87% ] 188/290 VUs  3m01.9s/3m30s  181.92 iters/s

running (3m02.9s), 193/290 VUs, 16248 complete and 0 interrupted iterations
step_ramp   [  87% ] 193/290 VUs  3m02.9s/3m30s  182.92 iters/s

running (3m03.9s), 193/290 VUs, 16431 complete and 0 interrupted iterations
step_ramp   [  88% ] 193/290 VUs  3m03.9s/3m30s  183.93 iters/s

running (3m04.9s), 190/290 VUs, 16619 complete and 0 interrupted iterations
step_ramp   [  88% ] 190/290 VUs  3m04.9s/3m30s  184.92 iters/s

running (3m05.9s), 204/290 VUs, 16790 complete and 0 interrupted iterations
step_ramp   [  89% ] 204/290 VUs  3m05.9s/3m30s  185.92 iters/s

running (3m06.9s), 280/290 VUs, 16901 complete and 0 interrupted iterations
step_ramp   [  89% ] 280/290 VUs  3m06.9s/3m30s  186.93 iters/s

running (3m07.9s), 294/303 VUs, 17059 complete and 0 interrupted iterations
step_ramp   [  89% ] 294/303 VUs  3m07.9s/3m30s  187.92 iters/s

running (3m08.9s), 275/307 VUs, 17261 complete and 0 interrupted iterations
step_ramp   [  90% ] 275/307 VUs  3m08.9s/3m30s  188.92 iters/s

running (3m09.9s), 278/307 VUs, 17448 complete and 0 interrupted iterations
step_ramp   [  90% ] 278/307 VUs  3m09.9s/3m30s  189.92 iters/s

running (3m10.9s), 248/307 VUs, 17666 complete and 0 interrupted iterations
step_ramp   [  91% ] 248/307 VUs  3m10.9s/3m30s  190.94 iters/s

running (3m11.9s), 235/307 VUs, 17873 complete and 0 interrupted iterations
step_ramp   [  91% ] 235/307 VUs  3m11.9s/3m30s  191.92 iters/s

running (3m12.9s), 224/307 VUs, 18076 complete and 0 interrupted iterations
step_ramp   [  92% ] 224/307 VUs  3m12.9s/3m30s  192.92 iters/s

running (3m13.9s), 205/307 VUs, 18289 complete and 0 interrupted iterations
step_ramp   [  92% ] 205/307 VUs  3m13.9s/3m30s  193.93 iters/s

running (3m14.9s), 205/307 VUs, 18483 complete and 0 interrupted iterations
step_ramp   [  93% ] 205/307 VUs  3m14.9s/3m30s  194.92 iters/s

running (3m15.9s), 204/307 VUs, 18679 complete and 0 interrupted iterations
step_ramp   [  93% ] 204/307 VUs  3m15.9s/3m30s  195.92 iters/s

running (3m16.9s), 216/307 VUs, 18864 complete and 0 interrupted iterations
step_ramp   [  94% ] 216/307 VUs  3m16.9s/3m30s  196.92 iters/s

running (3m17.9s), 290/307 VUs, 18987 complete and 0 interrupted iterations
step_ramp   [  94% ] 290/307 VUs  3m17.9s/3m30s  197.92 iters/s

running (3m18.9s), 322/323 VUs, 19131 complete and 0 interrupted iterations
step_ramp   [  95% ] 322/323 VUs  3m18.9s/3m30s  198.92 iters/s

running (3m19.9s), 302/329 VUs, 19339 complete and 0 interrupted iterations
step_ramp   [  95% ] 302/329 VUs  3m19.9s/3m30s  199.92 iters/s

running (3m20.9s), 290/329 VUs, 19511 complete and 0 interrupted iterations
step_ramp   [  96% ] 290/329 VUs  3m20.9s/3m30s  182.92 iters/s

running (3m21.9s), 239/329 VUs, 19765 complete and 0 interrupted iterations
step_ramp   [  96% ] 239/329 VUs  3m21.9s/3m30s  161.55 iters/s

running (3m22.9s), 194/329 VUs, 19961 complete and 0 interrupted iterations
step_ramp   [  97% ] 194/329 VUs  3m22.9s/3m30s  141.63 iters/s

running (3m23.9s), 135/329 VUs, 20152 complete and 0 interrupted iterations
step_ramp   [  97% ] 135/329 VUs  3m23.9s/3m30s  121.57 iters/s

running (3m24.9s), 130/329 VUs, 20269 complete and 0 interrupted iterations
step_ramp   [  98% ] 130/329 VUs  3m24.9s/3m30s  101.49 iters/s

running (3m25.9s), 116/329 VUs, 20375 complete and 0 interrupted iterations
step_ramp   [  98% ] 116/329 VUs  3m25.9s/3m30s  081.36 iters/s

running (3m26.9s), 097/329 VUs, 20465 complete and 0 interrupted iterations
step_ramp   [  99% ] 097/329 VUs  3m26.9s/3m30s  061.48 iters/s

running (3m27.9s), 073/329 VUs, 20540 complete and 0 interrupted iterations
step_ramp   [  99% ] 073/329 VUs  3m27.9s/3m30s  041.71 iters/s

running (3m28.9s), 043/329 VUs, 20602 complete and 0 interrupted iterations
step_ramp   [  99% ] 043/329 VUs  3m28.9s/3m30s  021.44 iters/s

running (3m29.9s), 022/329 VUs, 20634 complete and 0 interrupted iterations
step_ramp   [ 100% ] 022/329 VUs  3m29.9s/3m30s  003.16 iters/s

running (3m30.9s), 007/329 VUs, 20649 complete and 0 interrupted iterations
step_ramp ↓ [ 100% ] 022/329 VUs  3m30s  003.16 iters/s


  █ THRESHOLDS 

    http_req_duration
    ✓ 'p(95)<2000' p(95)=1.99s

    http_req_failed
    ✗ 'rate<0.02' rate=22.79%


  █ TOTAL RESULTS 

    checks_total.......: 20801  98.313433/s
    checks_succeeded...: 77.20% 16059 out of 20801
    checks_failed......: 22.79% 4742 out of 20801

    ✗ csrf 200
      ↳  3% — ✓ 145 / ✗ 3790
    ✗ submit 202
      ↳  94% — ✓ 15914 / ✗ 952

    HTTP
    http_req_duration..............: avg=519.4ms  min=0s      med=315.19ms max=2.23s p(90)=1.43s p(95)=1.99s
      { expected_response:true }...: avg=453.47ms min=3.35ms  med=349.34ms max=2.14s p(90)=1.07s p(95)=1.35s
    http_req_failed................: 22.79% 4742 out of 20801
    http_reqs......................: 20801  98.313433/s

    EXECUTION
    dropped_iterations.............: 343    1.621148/s
    iteration_duration.............: avg=822.05ms min=12.04ms med=544.86ms max=2.84s p(90)=2s    p(95)=2.01s
    iterations.....................: 20656  97.628108/s
    vus............................: 7      min=0             max=321
    vus_max........................: 329    min=100           max=329

    NETWORK
    data_received..................: 20 MB  95 kB/s
    data_sent......................: 7.3 MB 35 kB/s



running (3m31.6s), 000/329 VUs, 20656 complete and 0 interrupted iterations
step_ramp ✓ [ 100% ] 000/329 VUs  3m30s  003.16 iters/s